paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_206_drv.c
	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).
	P2SKIP = P2SKIP_B0__SKIPPED | P2SKIP_B1__SKIPPED   		//set p2.0 and p2.1 skipped for i2c slave mode
			| P2SKIP_B2__SKIPPED

			//because p2.5 is set analog mode ,so this bit must be skipped is used for for RSSI
			| 0x20;

	//5. set p2MASK
	P2MASK = P2MASK_B0__IGNORED | P2MASK_B1__IGNORED | P2MASK_B2__IGNORED
			| P2MASK_B3__IGNORED | P2MASK_B4__IGNORED | P2MASK_B5__IGNORED
			| P2MASK_B6__IGNORED ;

	//6. set P2MAT
	P2MAT = P2MAT_B0__HIGH | P2MAT_B1__HIGH | P2MAT_B2__HIGH | P2MAT_B3__HIGH
			| P2MAT_B4__HIGH | P2MAT_B5__HIGH | P2MAT_B6__HIGH ;

	SFRPAGE = SFRPAGE_SAVE;
}

static void _cwdm4_206_port3_init()
{
	uint8_t SFRPAGE_SAVE = SFRPAGE;

	SFRPAGE = 0x20;
	//1.set port default value
	P3 = P3_B0__HIGH | P3_B1__LOW | P3_B2__HIGH | P3_B3__HIGH | P3_B4__HIGH;

	//2.Select the input mode (analog or digital) for all port pins, using the Port Input Mode register (PnMDIN).
	P3MDIN = P3MDIN_B0__DIGITAL    //set p3.0 digital mode is INITL
			| P3MDIN_B1__DIGITAL   //set p3.1 digital mode is V3P3_EN
			| P3MDIN_B2__DIGITAL   //not used
			| P3MDIN_B3__DIGITAL   //notused
			| P3MDIN_B4__DIGITAL;   //not used

	//3. Select the output mode (open-drain or push-pull) for all port pins, using the Port Output Mode register (PnMDOUT).
	P3MDOUT = P3MDOUT_B0__OPEN_DRAIN   //because p3.0 is used INITL
			| P3MDOUT_B1__PUSH_PULL   //because p3.1 is used V3P3_EN
			| P3MDOUT_B2__OPEN_DRAIN   //not used
			| P3MDOUT_B3__OPEN_DRAIN   //not used 
			| P3MDOUT_B4__OPEN_DRAIN;   //not used

	//4. Select any pins to be skipped by the I/O crossbar using the Port Skip registers (PnSKIP).

	//p3 do't have p3SKIP registers

	//5. set p2MASK
	//p3 do't have P3MASK registers

	//6. set P2MAT
	//p3 do't have P3MAT registers
	SFRPAGE = SFRPAGE_SAVE;
}

static bool _cwdm4_206_txcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

	if(TX3V3_EN == 0x0)
	{
		MSA_p2_log("\r\ntxcdr is lower power mode");
		return false;
	}

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == SMB_read_byte(CWDM4_206_TXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\ntxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\ntxcdr smb read failed");
		}
		TIMER5_hw_delay_us(5000);
	}

	return false;
}

static bool _cwdm4_206_rxcdr_check_exist()
{
	uint8_t i = 0, Data = 0;

	if(TX3V3_EN == 0x0)
	{
		MSA_p2_log("\r\nrxcdr is lower power mode");
		return false;
	}

	for(i = 0; i < 3; i++)
	{
		if(GOS_OK == SMB_read_byte(CWDM4_206_RXCDR_BASE_ADDR, 0x0, &Data))
		{
			MSA_p2_log("\r\nrxcdr smb read OK");
			return true;
		}
		else
		{
			MSA_p2_log("\r\nrxcdr smb read failed");
		}
		TIMER5_hw_delay_us(5000);
	}

	return false;
}

static uint8_t _cwdm4_206_rxcdr_m37244_i2c_read_byte(uint8_t OffsetAddr, uint8_t *Data)
{
	if(TX3V3_EN == 0x0 || ((_i2c_dev_ready & RX_READY) == 0x0))
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(CWDM4_206_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_206_rxcdr_m37244_i2c_write_byte(uint8_t OffsetAddr,uint8_t Data)
{
	if(TX3V3_EN == 0x0 || ((_i2c_dev_ready & RX_READY) == 0x0))
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(CWDM4_206_RXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_206_txcdr_gn2105_i2c_read_byte(uint16_t OffsetAddr, uint8_t *Data)
{
	if(TX3V3_EN == 0x0 || ((_i2c_dev_ready & TX_READY) == 0x0))
	{
		return GOS_FAIL;
	}
	return SMB_read_byte(CWDM4_206_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static uint8_t _cwdm4_206_txcdr_gn2105_i2c_write_byte(uint16_t OffsetAddr, uint8_t Data)
{
	if(TX3V3_EN == 0x0 || ((_i2c_dev_ready & TX_READY) == 0x0))
	{
		return GOS_FAIL;
	}
	return SMB_write_byte(CWDM4_206_TXCDR_BASE_ADDR, OffsetAddr, Data);
}

static void _cwdm4_206_txcdr_gn2105_reset()
{
	TX_RST = 0;  //reset cdr
	TIMER_soft_delay_ms(10);
	TX_RST = 1;  //restore cdr

	if(_cwdm4_206_txcdr_check_exist())
	{
		_i2c_dev_ready |= TX_READY;
	}
}

static void _cwdm4_206_txcdr_gn2105_init()
{
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x472,0x00);  //PD_ALL    power on
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x078,0x00);  //L0_PD_LANE
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x178,0x00);  //L1_PD_LANE
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x278,0x00);  //L2_PD_LANE
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x378,0x00);  //L3_PD_LANE

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x448,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x449,0x00);    //ADC_PARAM_MON_CTRL_RESET
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x473,0x00);    //PD_SENSE_REG_0
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x433,0x00);    //TXDSBL_SOFT

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x078,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x079,0x01);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x084,0x01);  // bias enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x184,0x01);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x284,0x01);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x384,0x01);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x01c,0x02);  //L*_DRV_IMON_CTRL
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x11c,0x02);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x21c,0x02);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x31c,0x02);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x01b,0x00);  //L*L*_DRV_PD_MON_REG_0
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x11b,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x21b,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x31b,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x082,0x00);  // bias override
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x083,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x182,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x183,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x282,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x283,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x382,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x383,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x087,0x01);  // ch0 mod enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x187,0x01);  // ch1 mod enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x287,0x01);  // ch2 mod enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x387,0x01);  // ch3 mod enable

