paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_206_drv.c
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x085,0x00);  // ch0 Imod_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x086,0x00);  // ch0 Imod_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x185,0x00);  // ch1 Imod_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x186,0x00);  // ch1 Imod_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x285,0x00);  // ch2 Imod_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x286,0x00);  // ch2 Imod_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x385,0x00);  // ch3 Imod_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x386,0x00);  // ch3 Imod_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x023,0x1f);  // ch0 Icross_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x024,0x10);  // ch0 Icross_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x123,0x1f);  // ch1 Icross_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x124,0x10);  // ch1 Icross_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x223,0x1f);  // ch2 Icross_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x224,0x10);  // ch2 Icross_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x323,0x1f);  // ch3 Icross_dac_low
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x324,0x10);  // ch3 Icross_dac_high

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x08a,0x01);  // ch0 hfde enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x18a,0x01);  // ch1 hfde enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x28a,0x01);  // ch2 hfde enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x38a,0x01);  // ch3 hfde enable

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x088,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x089,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x188,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x189,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x288,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x289,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x388,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x389,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x08d,0x01);  // ch0 lfde enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x18d,0x01);  // ch1 lfde enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x28d,0x01);  // ch2 lfde enable
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x38d,0x01);  // ch3 lfde enable

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x08b,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x08c,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x18b,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x18c,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x28b,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x28c,0x00);

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x38b,0x00);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x38c,0x00);
}

static void _cwdm4_206_rxcdr_m37244_init()
{
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x03,0xf0);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x19,0xff);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x1b,0x03);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x23,0xf0);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x40,0xf0);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x42,0x1e);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x43,0x1e);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x44,0x1e);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x45,0x1e);
}

static void _cwdm4_206_rxcdr_m37244_reset()
{
	if(_cwdm4_206_rxcdr_check_exist())
	{
		_i2c_dev_ready |= RX_READY;
	}

	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x02, 0xaa);
	TIMER_soft_delay_ms(100);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x02, 0x00);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x03, 0xf0);
}

static void _cwdm4_206_get_bias_average_value(uint8_t channel, uint16_t *sink_dac, uint16_t *mod_dac)
{
	const uint16_t sink_reg[] = {0x070, 0x170, 0x270, 0x370};
	const uint16_t mon_reg[]  = {0x01b, 0x11b, 0x21b, 0x31b};
	const uint16_t mod_reg[]  = {0x06e, 0x16e, 0x26e, 0x36e};
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};
	uint8_t i = 0, value_h = 0, value_l = 0;

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x449, 0);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mon_reg[channel], 0);

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(sink_reg[channel], &value_l);
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(sink_reg[channel] + 1, &value_h); //bit9 8
		buff16[i] = value_l | ((value_h & 0x0F) << 8);
	}

	*sink_dac = com_average_value16(buff16, AVERAGE_MAX_COUNTER);

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(mod_reg[channel], &value_l);
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(mod_reg[channel] + 1, &value_h); //bit9 8
		buff16[i] = value_l | ((value_h & 0x0F) << 8);
	}

	*mod_dac = com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

/* Return in 0.1mA */
static float cwdm4_206_get_gn2105_bias(uint8_t channel)
{
	float result = 0.0;
	uint16_t  sink_dac = 0, mod_dac = 0;
	uint8_t   RPP = 0;

	_cwdm4_206_txcdr_gn2105_i2c_read_byte(0x466, &RPP);
	_cwdm4_206_get_bias_average_value(channel, &sink_dac, &mod_dac);
	result = ((float)sink_dac / (4095.0 * 8.774 * (1.145845 - 0.00463 * (float)RPP)) + (float)mod_dac / (2.0 * 4095.0 * 6.701 * (1.145845 - 0.00463 * (float)RPP))) * 1000.0 * 10.0;   //0.1mA
	return result;
}

static uint16_t _cwdm4_206_get_rssi_average_value()
{
	uint8_t i = 0;
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		buff16[i] = ADC0_manual_poll(ADC0_RSSI0) * 0.1;   // uint:mv
		TIMER5_hw_delay_us(2000);
	}

	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}

static uint16_t cwdm4_206_ddmi_get_rssi(uint8_t channel)
{
	uint8_t value = 0, i = 0;
	uint16_t rssi_mv = 0;

	channel = 3 - channel;  //rxcdr pin is inverted sequence with qsfp28 pin


	_cwdm4_206_rxcdr_m37244_i2c_read_byte(0x3, &value);
	value = SET_BIT(value,6);  //rssi enable
	if(channel == MSA_PWR_CHANNEL_1)
	{
		value = CLEAR_BIT(value,4);
		value = CLEAR_BIT(value,5);
	}
	else if(channel == MSA_PWR_CHANNEL_2)
	{
		value = SET_BIT(value,4);
		value = CLEAR_BIT(value,5);
	}
	else if(channel == MSA_PWR_CHANNEL_3)
	{
		value = CLEAR_BIT(value,4);
		value = SET_BIT(value,5);
	}
	else if(channel == MSA_PWR_CHANNEL_4)
	{
		value = SET_BIT(value,4);
		value = SET_BIT(value,5);
	}

	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x3, value);

	rssi_mv = _cwdm4_206_get_rssi_average_value();

