paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_206_drv.c
	return (uint16_t) ((float)rssi_mv / (float)CWDM4_206_RSSI_SERIES_RES * 1000.00);
}

#if defined(HW_VER_AM1_206)
static uint16_t _cwdm4_206_get_txmon_average_value(uint8_t channel)
{
	uint8_t i = 0, value_h = 0, value_l = 0;
	uint16_t buff16[AVERAGE_MAX_COUNTER] = {0};
	const uint16_t txmon_reg[] = {0x076, 0x176, 0x276, 0x376};
	const uint16_t mod_reg[]   = {0x01b, 0x11b, 0x21b, 0x31b};

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x449, 0);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mod_reg[channel], 0);

	for(i = 0; i < AVERAGE_MAX_COUNTER; i++)
	{
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(txmon_reg[channel], &value_l);
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(txmon_reg[channel] + 1, &value_h);
		buff16[i]  = value_l | ((value_h & 0x03) << 8);
	}

	return com_average_value16(buff16, AVERAGE_MAX_COUNTER);
}
#endif


#if defined(HW_VER_AM1_206)
static uint16_t cwdm4_206_ddmi_get_txmon(uint8_t channel)
{
	/*
	uint8_t  RPP = 0,value8 = 0;
	uint16_t value16 = 0;
	uint16_t imod_reg[] = {0x01c,0x11c,0x21c,0x31c};
	float coefficient[8] = {2346.0, 786.7, 394.1, 198.0, 2327.0, 781.2, 391.0, 196.9}, K = 0.0;

	_cwdm4_206_txcdr_gn2105_i2c_read_byte(0x465, &RPP);
	value16 = _cwdm4_206_get_txmon_average_value(channel);
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(imod_reg[channel], &value8);
	K = coefficient[value8 & 0x07];
	return (uint16_t)(((float)value16 / (1023.0 * K * (1.145845 - 0.00463 * (float)RPP))) * 1000.0 * 10.0);   //0.1mA
	*/
	return 0;
}
#endif


#if defined(HW_VER_AM2_206)
static uint16_t cwdm4_206_ddmi_get_txmon(uint8_t channel)
{
	const uint16_t up_vcc = 25000;
	uint16_t mpd = ADC0_get_mpd(channel);

	if(up_vcc >= mpd)
	{
		return up_vcc - mpd;
	}
	else
	{
		return 0;
	}
}
#endif


static void  cwdm4_206_drv_check_laser_ch(SFP_DRV_LASER_CFG_T *cfg)
{
	if(cfg->bias > 1000)
	{
		cfg->bias = 800;
	}
	if(cfg->mod > 1000)
	{
		cfg->mod = 800;
	}
}

//***********************************************public function***************************************/

void CWDM4_206_chip_reset(void)
{
	_cwdm4_206_txcdr_gn2105_reset();
	_cwdm4_206_rxcdr_m37244_reset();
}

void CWDM4_206_port_init(void)// mcu_port_init
{
	_cwdm4_206_port0_init();
	_cwdm4_206_port1_init();
	_cwdm4_206_port2_init();
	_cwdm4_206_port3_init();
}

void CWDM4_206_chip_init(void)		// init
{
	CWDM4_206_chip_reset();
	_cwdm4_206_txcdr_gn2105_init();
	_cwdm4_206_rxcdr_m37244_init();
}

int16_t CWDM4_206_ddmi_get_temp(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return ((int16_t)((float)(ddmi_cali->temp) * TIMER_temp_slow_boot_cal()) + ADC0_get_mcu_temp()); 		//MSA format uint: 1/256 C
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  ((int16_t)ADC0_get_mcu_temp());  //MSA format uint:1/256ÉãÊÏ¶È
	}

	return GOS_FAIL;
}

uint16_t CWDM4_206_ddmi_get_vcc(MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		return (ddmi_cali->vcc + ADC0_get_vcc()); //uint:0.1mv
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return ADC0_get_vcc();  //uint:0.1mV
	}

	return GOS_FAIL;
}

uint16_t CWDM4_206_ddmi_get_bias(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		uint16_t bias = 0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T	 *laser_stat = MSA_p4_get_laser_state();

		//ddmi_cali->bias uint:0.1mA
		bias  = (uint16_t)(((ddmi_cali->current[channel].bias.bias_offset2 - ddmi_cali->current[channel].bias.bias_offset1)  + laser_stat->ch[channel].stat.txbias) * 0.1 * 1000.0 * 0.5); //uint:2uA
		return  bias;  //uint:2uA
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return (uint16_t)(cwdm4_206_get_gn2105_bias(channel));
	}
	return GOS_FAIL;
}

uint16_t CWDM4_206_ddmi_get_rx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float rxpower_result = 0.0 ,rxpower1 = 0.0, rxpower2 = 0.0, rssi1 = 0.0, rssi2 = 0.0;
		const DDMI_CALI_PARA_T *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		*laser_stat = MSA_p4_get_laser_state();

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rxpower1 uint:0.1uw
		rxpower1 = (float)ddmi_cali->current[channel].rxpower.rxpower1 * 0.1 / 1000.0;  //uint:mW
		rxpower2 = (float)ddmi_cali->current[channel].rxpower.rxpower2 * 0.1 / 1000.0;  //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].rxpower.rssi1 uint:uA
		rssi1 	 = (float)ddmi_cali->current[channel].rxpower.rssi1;
		rssi2 	 = (float)ddmi_cali->current[channel].rxpower.rssi2;

		if(rssi2 != rssi1)
		{
			  rxpower_result = rxpower1 + ((float)laser_stat->ch[channel].stat.rssi - rssi1) * ((rxpower2 - rxpower1) / (rssi2 - rssi1));  //uint: mW
		}

		CHECK_POWER_MIN(rxpower_result);
		CHECK_POWER_MAX(rxpower_result);
		return (uint16_t)(rxpower_result * 10.0 * 1000.0);  //MSA format uint:0.1uW
	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return  (uint16_t)cwdm4_206_ddmi_get_rssi(channel);  //uint:ua
	}

	return GOS_FAIL;
}

uint16_t CWDM4_206_ddmi_get_tx_power(uint8_t channel, MSA_DRV_VAL_TYPE type)
{
	if(type == MSA_DRV_VAL_NORM)
	{
		float txpower_result = 0.0, txpower1 = 0.0, txpower2 = 0.0, txmon1 = 0.0, txmon2 = 0.0,txmon_N = 0.0;
		const DDMI_CALI_PARA_T    *ddmi_cali = MSA_p67_get_ddmi_cali_cfg();
		const MSA_LUT_T 		  *laser_stat = MSA_p4_get_laser_state();
		const SFP_DRV_LASER_CFG_T *lo_cfg = (SFP_DRV_LASER_CFG_T *)MSA_p67_get_drv_lut();
		const SFP_DRV_LASER_CFG_T *m_cfg  = (lo_cfg + MSA_CHANNEL_NUM);

		//laser_stat->ch[channel].stat.txpwr uint:0.1mA
		txmon_N = (float)laser_stat->ch[channel].stat.txpwr * 0.1;

		//ddmi_cali->tx_rx_pwr[channel].txpower.txpower uint:0.1uw
		txpower1 = (float)ddmi_cali->current[channel].txpower.txpower1 * 0.1 / 1000.0; //uint:mW
		txpower2 = (float)ddmi_cali->current[channel].txpower.txpower2 * 0.1 / 1000.0; //uint:mW

		//ddmi_cali->tx_rx_pwr[channel].txpower.bias uint:0.1mA
		txmon1 = (float)ddmi_cali->current[channel].txpower.bias1 * 0.1; //uint:mA
		txmon2 = (float)ddmi_cali->current[channel].txpower.bias2 * 0.1; //uint:mA

