paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_206_drv.c
		if(txmon1 != txmon2)
		{
			txpower_result = txpower1 + (txpower1 - txpower2)/(txmon1 - txmon2) * (txmon_N - txmon1);  //uint:mW
		}

		CHECK_POWER_MIN(txpower_result);
		CHECK_POWER_MAX(txpower_result);
		return (uint16_t)(txpower_result * 1000.0 * 10.0); //MSA format uint:0.1uW

	}
	else if(type == MSA_DRV_VAL_HW)
	{
		return cwdm4_206_ddmi_get_txmon(channel); //0.1mA
	}
	return GOS_FAIL;
}

void CWDM4_206_drv_adjust_laser_ch(uint8_t ch, SFP_DRV_LASER_CFG_T *cfg)
{
	uint16_t mod_hfde = 0, mod_lfde = 0;
	float k_hlf = 0.05;
	static code uint16_t bias_reg[]	    = {0x082, 0x182, 0x282, 0x382};
	static code uint16_t mod_reg[]	    = {0x085, 0x185, 0x285, 0x385};
	static code uint16_t cross_reg[]    = {0x023, 0x123, 0x223, 0x323};
	static code uint16_t mod_hfde_reg[] = {0x088, 0x188, 0x288, 0x388};
	static code uint16_t mod_lfde_reg[] = {0x08b, 0x18b, 0x28b, 0x38b};

	mod_hfde = (uint16_t)floor((2.0 *k_hlf*(0.784226 * (float)cfg->mod - 16.0)/0.4 + 0.5));
	mod_lfde = (uint16_t)floor((2.0 *k_hlf*(0.784226 * (float)cfg->mod - 16.0)/0.4 + 0.5));

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(bias_reg[ch], (uint8_t)(U16_LSB(cfg->bias)) );
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(bias_reg[ch] + 1, (uint8_t)((U16_MSB(cfg->bias)) & 0x03));
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mod_reg[ch], (uint8_t)(U16_LSB(cfg->mod)));
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mod_reg[ch] + 1, (uint8_t)((U16_MSB(cfg->mod)) & 0x03));
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(cross_reg[ch], (uint8_t)(U16_LSB(cfg->cross) & 0x1F));
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(cross_reg[ch] + 1, (uint8_t)((U16_MSB(cfg->cross)) & 0x1F));

	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mod_hfde_reg[ch], (uint8_t)(U16_LSB(mod_hfde)));
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mod_hfde_reg[ch] + 1, (uint8_t)((U16_MSB(mod_hfde)) & 0x03));
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mod_lfde_reg[ch], (uint8_t)(U16_LSB(mod_lfde)));
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(mod_lfde_reg[ch] + 1, (uint8_t)((U16_MSB(mod_lfde)) & 0x03));
}

void CWDM4_206_drv_get_laser_full_state(uint8_t channel, MSA_LUT_T *lut)
{
	static code uint16_t bias_reg[]	 = {0x082, 0x182, 0x282, 0x382};
	static code uint16_t mod_reg[]	 = {0x085, 0x185, 0x285, 0x385};
	static code uint16_t cross_reg[] = {0x023, 0x123, 0x223, 0x323};

	uint8_t bias_low, mod_low, cross_low;
	uint8_t bias_high, mod_high, cross_high;

	lut->temp = DDM_GET_TEMP(MSA_DRV_VAL_HW);

	_cwdm4_206_txcdr_gn2105_i2c_read_byte(bias_reg[channel],  &bias_low);
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(bias_reg[channel] + 1,  &bias_high);
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(mod_reg[channel],	 &mod_low);
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(mod_reg[channel] + 1,	 &mod_high);
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(cross_reg[channel], &cross_low);
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(cross_reg[channel] + 1, &cross_high);

	lut->ch[channel].config.bias = (uint16_t)(bias_low | (bias_high & 0x03) << 8);
	lut->ch[channel].config.mod  = (uint16_t)(mod_low | (mod_high & 0x03) << 8);
	lut->ch[channel].config.cross = (uint16_t)((cross_low & 0x1F) | (cross_high & 0x1F) << 8);
	return ;
}

void CWDM4_206_drv_ch_calc_cfg (int16_t cur_temp, uint8_t ch, const SFP_DRV_LASER_CFG_T *lut, SFP_DRV_LASER_CFG_T *ret)
{
	SFP_DRV_LASER_CFG_T *lo_cfg = (lut + ch);
	SFP_DRV_LASER_CFG_T *m_cfg	= (lo_cfg + MSA_CHANNEL_NUM);
	SFP_DRV_LASER_CFG_T *hi_cfg = (m_cfg + MSA_CHANNEL_NUM);
	int16_t temp_l = 0, temp_r = 0, temp_h = 0;
	float a1 = 0.0, a2 = 0.0, a3 = 0.0;
	APC_CALI_PARAM para;

	ret->temp = cur_temp;

	ret->bias  = 86;
	ret->mod   = 306;
	ret->cross = 4127;


	if(!MSA_p67_check_apc_lut_tab(lut))  //apc paramters is invalid, so there is no need to apc calibration
	{
		return;
	}

	if (cur_temp <= m_cfg->temp)
	{
		if((m_cfg->temp == lo_cfg->temp))
		{
			return;
		}

		ret->bias = (uint16_t )(floor(0.5 + (double)lo_cfg->bias +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->bias - lo_cfg->bias))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->mod = (uint16_t)(floor(0.5 + (double)lo_cfg->mod +
						((double)(cur_temp - lo_cfg->temp)) * ((double)(m_cfg->mod - lo_cfg->mod))
						/ ((double)(m_cfg->temp - lo_cfg->temp))));
		ret->cross = 4127;

	}
	else
	{
		if(lo_cfg->temp == m_cfg->temp || lo_cfg->temp == hi_cfg->temp || m_cfg->temp == hi_cfg->temp)
		{
			return;
		}

		//MSA_p2_log("\r\n bias_l = %hd,bias_r = %hd,bias_h = %hd",lo_cfg->bias,m_cfg->bias,hi_cfg->bias);

		//MSA_p2_log("\r\n tl = %hd, tr = %hd, th = %hd",lo_cfg->temp,m_cfg->temp,hi_cfg->temp);

		temp_l = lo_cfg->temp / TEMP_SCALE;
		temp_r = m_cfg->temp  / TEMP_SCALE;
		temp_h = hi_cfg->temp / TEMP_SCALE;

		a1 = (double)lo_cfg->bias /((double)(temp_l - temp_r) * (double)(temp_l - temp_h));
		a2 = (double)m_cfg->bias  /((double)(temp_r - temp_l) * (double)(temp_r - temp_h));
		a3 = (double)hi_cfg->bias /((double)(temp_h - temp_l) * (double)(temp_h - temp_r));

		//MSA_p2_log("\r\n a1= %f,a2 = %f, a3= %f",a1,a2,a3);

		para.a = a1 + a2 + a3;
		para.b = -a1 * (double)(temp_r + temp_h) - a2 * (double)(temp_l + temp_h) - a3 * (double)(temp_l + temp_r);
		para.c = a1 * (double)(temp_r) * (double)(temp_h) + a2 * (double)(temp_l) * (double)(temp_h) + a3 * (double)(temp_l) * (double)(temp_r);
		ret->bias = (uint16_t)(floor(0.5 + (para.a * pow((float)(cur_temp/TEMP_SCALE), 2.0) + para.b * (float)(cur_temp/TEMP_SCALE) + para.c)));

		//MSA_p2_log("\r\n a= %f,b = %f, c= %f, bias = %hd",para.a, para.b, para.c, ret->bias);

		a1 = (double)lo_cfg->mod /((double)(temp_l - temp_r) * (double)(temp_l - temp_h));
		a2 = (double)m_cfg->mod  /((double)(temp_r - temp_l) * (double)(temp_r - temp_h));
		a3 = (double)hi_cfg->mod /((double)(temp_h - temp_l) * (double)(temp_h - temp_r));

		//MSA_p2_log("\r\n a1= %f,a2 = %f, a3= %f",a1,a2,a3);

		para.a = a1 + a2 + a3;
		para.b = -a1 * (double)(temp_r+ temp_h) - a2 * (double)(temp_l + temp_h) - a3 * (double)(temp_l + temp_r);
		para.c =  a1 * (double)(temp_r) * (double)(temp_h) + a2 * (double)(temp_l) * (double)(temp_h) + a3 * (double)(temp_l) * (double)(temp_r);
		ret->mod = (uint16_t)(floor(0.5 + (para.a * pow((float)(cur_temp/TEMP_SCALE), 2.0) + para.b * (float)(cur_temp/TEMP_SCALE) + para.c)));
		ret->cross = 4127;

		//MSA_p2_log("\r\n bias= %hd,mod = %hd",ret->bias, ret->mod);

