paddy2008/sfp_project/QSFP28/src/Efm8lb12_100g_cwdm4_206_drv.c
	}

	cwdm4_206_drv_check_laser_ch(ret);
	return ;
}

void CWDM4_206_drv_poll(void)
{
	ADC0_poll();
	return ;
}

MSA_INTR_STATUS_T *CWDM4_206_get_drv_intr_status(uint8_t intr_mask)
{
	static MSA_INTR_STATUS_T status;
	uint8_t value = 0;

	if(intr_mask & PORT_INTR_TX_FAULT)
	{
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(0x437, &value);  //get tx fault
		status.tx_fault = (value & 0x0F);
	}
	if(intr_mask & PORT_INTR_TX_LOS)
	{
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(0x413, &value);  //get tx los
		status.tx_los = (value & 0x0F);
	}
	if(intr_mask & PORT_INTR_TX_LOL)
	{
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(0x413, &value);  //get tx lol
		status.tx_lol = (value & 0xF0) >> 4;
	}
	if(intr_mask & PORT_INTR_RX_LOL)
	{
		_cwdm4_206_rxcdr_m37244_i2c_read_byte(0x17, &value);  //get rx lol
		status.rx_lol = REVERSE_LSB_4BITS(((value & 0xF0) >> 4));
	}
	if(intr_mask & PORT_INTR_RX_LOS)
	{
		_cwdm4_206_rxcdr_m37244_i2c_read_byte(0x17, &value);  //get rx los
		status.rx_los = REVERSE_LSB_4BITS(value & 0x0F);
	}
	return &status;

}

//MSA Lower Page byte93 for power override
void CWDM4_206_set_low_power(uint8_t enable)
{
	if(enable)
	{
		MSA_pin_set_low_power_mode(0);
		IT01CF &= ~IT01CF_IN0PL__ACTIVE_HIGH;
		//TX3V3_EN = 0;  //close tx3v3 in order to realize low power mode
		TX_RST = 0;    //make TX_RST = 0 to prevent mcu provide voltage to cdr chip
		SDA_M = 0;
		SCL_M = 0;
	}
	else
	{
		MSA_pin_set_low_power_mode(1);
		IT01CF |= IT01CF_IN0PL__ACTIVE_HIGH;
		TX3V3_EN = 1; //open tx3v3 in order to realize high power mode
		TX_RST = 1;
		SDA_M = 1;
		SCL_M = 1;
	}
}


//MSA Lower Page byte86 for tx disable
void CWDM4_206_set_tx_enable(uint8_t enale)
{
	uint8_t value = 0;
	
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(0x433,&value);
	value = CLEAR_LSB_4BITS(value) | CLEAR_MSB_4BITS(enale);
	_cwdm4_206_txcdr_gn2105_i2c_write_byte(0x433, value);
	_cwdm4_206_txcdr_gn2105_i2c_read_byte(0x433,&value);
}

//MSA Lower Page byte98 for tx and rx cdr control
void CWDM4_206_set_cdr_control(uint8_t value)
{
	uint8_t tx_cdr_control = 0, rx_cdr_control = 0, tmp = 0, i = 0;
	uint16_t reg_addr[] = {0x000, 0x100, 0x200, 0x300};

	tx_cdr_control = ((~value) & 0xF0) >> 4;
	rx_cdr_control = ((~value) & 0x0F);
	rx_cdr_control = REVERSE_LSB_4BITS(rx_cdr_control);

	for(i = 0; i < MSA_CHANNEL_NUM; i++)
	{
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(reg_addr[i], &tmp);  //set tx cdr control
		tmp = CLEAR_BIT(tmp, 0);
		tmp |= GET_BIT(tx_cdr_control,i);
		_cwdm4_206_txcdr_gn2105_i2c_write_byte(reg_addr[i], tmp);  //set tx cdr control
	}

	_cwdm4_206_rxcdr_m37244_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_LSB_4BITS(tmp)| rx_cdr_control;
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x10, tmp);  //set rx cdr control
}

//MSA Page3 byte234 and byte235 for tx eq
void CWDM4_206_set_tx_eq(uint8_t channel, uint8_t value)
{
	channel = value = 0;
}

//MSA Page3 byte236 and byte237 for rx emphasis
void CWDM4_206_set_rx_emphasis(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x46, 0x46,0x47,0x47};
	uint8_t rx_emphasis[] = {0x0, 0x3, 0x5, 0x7,0x9, 0xb, 0xd, 0xf};
	uint8_t tmp = 0;

	if(value > RX_EMPHASIS_MAX_VALID)
	{
		return ;
	}

	//rx channel reverse,rxcdr pin is inverted sequence with qsfp28 pin
	channel = 3 - channel;

	_cwdm4_206_rxcdr_m37244_i2c_read_byte(reg_addr[channel], &tmp);

	if(channel == 0x0 || channel == 0x2)
	{
		value = CLEAR_LSB_4BITS(tmp) | rx_emphasis[value];
	}
	else if(channel == 0x1 || channel == 0x3)
	{
		value = CLEAR_MSB_4BITS(tmp) | (rx_emphasis[value] << 4);
	}

	_cwdm4_206_rxcdr_m37244_i2c_write_byte(reg_addr[channel], value);
}

//MSA Page3 byte238 and byte239 rx amplitude
//0x3 900  --0x3c
//0x2 600  --0x1e
//0x1 450  --0x0f
//0x0 250  --0x00
void CWDM4_206_set_rx_amplitude(uint8_t channel, uint8_t value)
{
	uint8_t reg_addr[] = {0x42,0x43,0x44,0x45};
	uint8_t rx_amplitude[] = {0x00, 0x0f, 0x1e, 0x3c};
	uint8_t tmp = 0;

	if(value > RX_AMPLITUDE_MAX_VALID)
	{
		return;
	}

	//rx channel reverse,rxcdr pin is inverted sequence with qsfp28 pin
	channel = 3 - channel;

	_cwdm4_206_rxcdr_m37244_i2c_read_byte(reg_addr[channel], &tmp);

	value = (tmp & 0xC0) | rx_amplitude[value];

	_cwdm4_206_rxcdr_m37244_i2c_write_byte(reg_addr[channel], value);
}

//MSA Page3 byte240 sq disable
void CWDM4_206_set_cdr_sq_disable(uint8_t value)
{
	uint8_t tx_sq = 0, rx_sq = 0, tmp = 0, i = 0;
	uint16_t reg_addr[] = {0x014, 0x114, 0x214, 0x314};

	rx_sq = (value & 0xF0) >> 4;
	tx_sq  = ~(value & 0x0F);
	rx_sq = REVERSE_LSB_4BITS(rx_sq);

	for(i = 0; i < MSA_CHANNEL_NUM; i++)
	{
		tmp = 0;
		_cwdm4_206_txcdr_gn2105_i2c_read_byte(reg_addr[i], &tmp);  //set tx cdr control
		tmp = CLEAR_BIT(tmp, 0);
		tmp |= GET_BIT(tx_sq,i);
		_cwdm4_206_txcdr_gn2105_i2c_write_byte(reg_addr[i], tmp);  //set tx cdr control
	}

	_cwdm4_206_rxcdr_m37244_i2c_read_byte(0x40,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_sq << 4);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x40, tmp);  //set rx cdr control
}

//MSA Page3 byte241 for rx output disable
void CWDM4_206_set_rx_output_disable(uint8_t value)
{
	uint8_t rx_output_disable = 0,  tmp = 0;

	rx_output_disable = (value & 0xF0) >> 4;
	rx_output_disable = REVERSE_LSB_4BITS(rx_output_disable);

	_cwdm4_206_rxcdr_m37244_i2c_read_byte(0x10,&tmp);
	tmp = CLEAR_MSB_4BITS(tmp)| (rx_output_disable << 4);
	_cwdm4_206_rxcdr_m37244_i2c_write_byte(0x10, tmp);
}

//MSA Page3 byte241 for tx adapt eq
void CWDM4_206_set_tx_adapt_eq(uint8_t value1, uint8_t value2, uint8_t value3)
{
	value1 = value2 = value3 = 0;
}

#endif




